app/controllers/relatos_controller.rb

	def index
		@relatos = Relato.where(user_id: current_user).order("created_at DESC")
	    if params[:search]
	      @relatos = Relato.where("titulo like ?","%#{params[:search]}%")
	    else
	      @relatos = Relato.all
---
SELECT "relatos".* FROM "relatos" WHERE (titulo like '%a%')
SELECT "relatos".* FROM "relatos" ORDER BY created_at DESC

	def create
		@relato = Relato.new(relato_params)
		if @relato.save
---
INSERT INTO "relatos" ("titulo", "relato", "created_at", "updated_at", "Sentimento") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

	def update
		if @relato.update(relato_params)
---
UPDATE "relatos" SET "titulo" = $1, "relato" = $2, "updated_at" = $3 WHERE "relatos"."id" = $4  [["titulo", "dfasd"], ["relato", "adfas"], ["updated_at", "2018-05-22 16:22:19.619969"], ["id", 1]]

	def destroy
		@relato.destroy
---
DELETE FROM "relatos" WHERE "relatos"."id" = $1  [["id", 23]]

		def set_relato
			@relato = Relato.find(params[:id])
---
SELECT  "relatos".* FROM "relatos" WHERE "relatos"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]